zzz-school/tt01/src/wsdl_soap/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2003/XMLSchema-instance"
	xmlns:web="http://WebXml.com.cn/" xmlns:xsd="http://www.w3.org/2003/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<web:getMobileCodeInfo>
			<mobileCode>17321242779</mobileCode>
			<userID></userID>
		</web:getMobileCodeInfo>
	</soap:Body>
</soap:Envelope>



<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2003/XMLSchema-instance"
	xmlns:web="http://WebXml.com.cn/" xmlns:xsd="http://www.w3.org/2003/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<web:getDatabaseInfo></web:getDatabaseInfo>
	</soap:Body>
</soap:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2003/XMLSchema-instance"
	xmlns:web="http://WebXml.com.cn/" xmlns:xsd="http://www.w3.org/2003/XMLSchema"
	xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
	<soap12:Body>
		<web:getMobileCodeInfo>17321242779</web:getMobileCodeInfo>
	</soap12:Body>
</soap12:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:web="http://WebXml.com.cn/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<web:getWeather>
			<theCityCode>2013</theCityCode>
		</web:getWeather>
	</soap:Body>
</soap:Envelope>