NetworkCommunication/webservice/src/main/java/com/yu/webservice/soap/soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:q0="http://WebXml.com.cn/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<q0:getMobileCodeInfo>
			<q0:mobileCode>15626217879</q0:mobileCode>
		</q0:getMobileCodeInfo>
	</soapenv:Body>
</soapenv:Envelope>